10/data/attachments/9dd22ad9f57c8ad6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d535f6f4-5973-4e41-a281-afdc7dc84fea</nif:username>
            <nif:friendToBeAdded>Kevin_painting_Friend_38432_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>